---
kind: method
id: M:Autodesk.Revit.DB.ProjectLocationSet.#ctor
source: html/29d38619-c768-cd20-ce4a-96477408ac13.htm
---
# Autodesk.Revit.DB.ProjectLocationSet.#ctor Method

Initializes a new instance of the ProjectLocationSet class

## Syntax (C#)
```csharp
public ProjectLocationSet()
```